# Taps
# tap 'homebrew/cask'
# tap 'homebrew/bundle'

# Binaries
brew 'gh'
brew 'git'
brew 'mas' # Mac App Store manager
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# Development
brew 'fnm' # Node.js version manager
# brew 'imagemagick' # Image processing
brew 'yarn' # Package manager
# brew 'watchman' # File watching for React-Native
brew 'powerlevel10k' # Prompt for Zsh

# Apps
cask '1password'
cask 'alfred'
cask 'daisydisk'
cask 'discord'
cask 'fantastical'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
# cask 'paragon-ntfs'
cask 'postman'
cask 'slack'
cask 'steam'
cask 'sublime-text'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
# cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'webstorm'
cask 'zoom'
# cask 'zulu@17' # Java 17 for Android Studio React Native Development

# Quicklook
# cask 'qlmarkdown'
# cask 'quicklook-json'

# Fonts
cask 'font-meslo-for-powerlevel10k'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Remote Mouse', id: 403195710
mas 'Things', id: 904280696
